/*
ما يمكن للمدير تعديله في صفحة طرق الدفع؟

لكل طريقة:

الاسم العربي والإنجليزي
النوع
هل تحتاج حسابًا بنكيًا؟
هل تحتاج مزود دفع؟
هل تحتاج رفع إثبات؟
حالة التفعيل
ترتيب العرض

مثال:

تحويل بنكي
النوع: Offline
يحتاج حسابًا بنكيًا: نعم
يحتاج مزود دفع: لا
يحتاج رفع إثبات: نعم
مفعل: نعم

أما:

مدى
النوع: Online
يحتاج حسابًا بنكيًا: لا
يحتاج مزود دفع: نعم
يحتاج رفع إثبات: لا
مفعل: نعم
*/

import React from 'react'

export default function AdminPaymentMethodsPage() {
  return (
    <div>AdminPaymentMethodsPage</div>
  )
}
