// خاص بإنشاء خيارات الترتيب بناءً على معايير معينة
/*
    * 🟢 buildSort
    * وظيفة: بناء كائن الترتيب (sort) لعمليات البحث في قاعدة البيانات بناءً على معايير الترتيب المحددة.
    * المدخلات: كائن يحتوي على خصائص الترتيب (sort, order).
    * المخرجات: كائن يحتوي على الحقل المراد ترتيبه وقيمة الترتيب (1 للترتيب التصاعدي، -1 للترتيب التنازلي).
     * إذا لم يتم تحديد حقل الترتيب، يتم ترتيب النتائج بشكل افتراضي حسب تاريخ الإنشاء (createdAt) بترتيب تنازلي.
*/

export const buildSort = ({ sort, order }) => {
const allowedSortFields = ["nameEn", "nameAr", "createdAt", "rating"]; // الحقول المسموح بالترتيب عليها
  if (!allowedSortFields.includes(sort)){
    return { createdAt: -1 };// الترتيب الافتراضي حسب تاريخ الإنشاء تنازلي
  }   
  const direction = order === "desc" ? -1 : 1; // تحديد اتجاه الترتيب
  return { [sort]: direction };
};
